salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
months = 10  # Количество месяцев, которое планируется протянуть без долгов
increase = 0.03  # Ежемесячный рост цен

q_increase = 1 + increase  # Коэффициент ежемесячного роста цен 1,03
money_capital = 0

for i in range(months):
    money_capital += salary  # Начисление зарплаты в начале месяца
    money_capital -= spend  # Траты (в 1 месяце = 6000, далее увеличиваются в 1,03 раза)
    spend *= q_increase  # Увеличение трат в 1,03 раза

""" В результате работы цикла получаем отрицательное число -
величину долга через 10 месяцев, если подушка безопасности = 0.
Необходимая минимальная подушка безопасности может быть получена умножением этого долга на -1
"""

print(f"Подушка безопасности, чтобы протянуть {months} месяцев без долгов:", round(money_capital * -1, 2))
