money_capital = 20000  # Подушка безопасности
salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
increase = 0.05  # Ежемесячный рост цен

q_increase = 1 + increase  # Коэффициент ежемесячного роста цен
n = 0  # Количество месяцев без долгов, изначально равное 0

while True:  # Создаем бесконечный цикл, который остановится при выполнении условия if...
    deficit = spend - salary  # Cумма, которая будет взята из подушки безопасности
    if money_capital < deficit:  # Если подушка безопасности не может покрыть дефицит, цикл обрывается
        break

    money_capital -= deficit  # Дефицит покрывается из подушки безопасности
    spend *= q_increase  # Ежемесячный рост цен в 1,05 раз
    n += 1  # Порядковый номер рассчитанного месяца

print("Количество месяцев, которое можно протянуть без долгов:", n)
